{
  "jevisclass": "Recooler or Condenser",
  "names": {
    "de": "Rückkühler oder Kondensator",
    "ru": "Переохладитель или конденсатор",
    "en": "Recooler or Condenser",
    "th": "Recooler หรือคอนเดนเซอร์",
    "uk": "Рекулер або конденсатор",
    "ar": "جهاز إعادة تبريد أو مكثف"
  },
  "descriptions": {
    "de": "Die Klasse Rückkühler oder Kondensator enthält Daten des Rückkühler oder Kondensator der Gebäudeausrüstung. Zu den Attributen der Klasse gehört eine vollständige Beschreibung der spezifischen Energiedaten des Rückkühler oder Kondensator.",
    "ru": "Класс переохладителя или конденсатора содержит данные о переохладителе или конденсаторе строительного оборудования. Атрибуты класса включают в себя полное описание конкретных энергетических данных переохладителя или конденсатора.",
    "en": "The class Recooler or Condenser contains data of the building equipment recooler or condenser. Attributes of the class include a complete description of the specific energy data of the recooler or condenser.",
    "th": "คลาสของตัวจัดคิวหรือคอนเดนเซอร์มีข้อมูลของตัวจัดคิวหรือคอนเดนเซอร์ของอุปกรณ์ในอาคาร คุณลักษณะของคลาสรวมถึงคำอธิบายแบบเต็มของข้อมูลพลังงานเฉพาะของ recooler หรือคอนเดนเซอร์",
    "uk": "Клас переохолоджувача або конденсатора містить дані рекулера або конденсатора будівельного обладнання. Атрибути класу включають повний опис конкретних даних про енергію переохолоджувача або конденсатора.",
    "ar": "تحتوي فئة المبرد الجاف أو المكثف على بيانات المبرد الجاف أو المكثف لمعدات البناء. تتضمن سمات الفئة وصفًا كاملاً لبيانات الطاقة المحددة لجهاز إعادة التبريد أو المكثف."
  },
  "types": [
    {
      "type": "Recooling Capacity",
      "descriptions": {
        "de": "Rückkühlleistung",
        "ru": "Производительность переохлаждения",
        "en": "Recooling Capacity",
        "th": "กำลังการโหลดซ้ำ",
        "uk": "Відновлення ємності",
        "ar": "قدرة إعادة التبريد"
      },
      "names": {
        "de": "Rückkühlleistung",
        "ru": "Производительность переохлаждения",
        "en": "Recooling Capacity",
        "th": "กำลังการโหลดซ้ำ",
        "uk": "Відновлення ємності",
        "ar": "قدرة إعادة التبريد"
      }
    },
    {
      "type": "Remark",
      "descriptions": {
        "de": "Anmerkung",
        "ru": "аннотирование",
        "en": "Remark",
        "th": "คำอธิบายประกอบ",
        "uk": "анотація",
        "ar": "ملاحظة"
      },
      "names": {
        "de": "Anmerkung",
        "ru": "аннотирование",
        "en": "Remark",
        "th": "คำอธิบายประกอบ",
        "uk": "анотація",
        "ar": "ملاحظة"
      }
    }
  ]
}
