{
  "jevisclass": "Report Link",
  "names": {
    "de": "Berichtsverknüpfung",
    "ru": "Ссылка на отчет",
    "en": "Report Link",
    "th": "ลิงค์รายงาน",
    "uk": "Посилання на звіт"
  },
  "descriptions": {
    "de": "Die Berichtsverknüpfung wird für die Datenbefüllung benötigt. Sie verknüpft ein JEVis-Objekt im Baum des JEVisControlCenters mit einer Variablen in der Vorlagen-Datei.",
    "ru": "Ссылка на отчет необходима для заполнения данных. Он связывает объект JEVis в дереве JEVisControlCenter с переменной в файле шаблона.",
    "en": "The Report Link is needed for the data filling process. It links a JEVisObject in the tree of the JEConfig to a variable in the template file.",
    "th": "จำเป็นต้องมีลิงก์รายงานสำหรับการกรอกข้อมูล เชื่อมโยงวัตถุ JEVis ในโครงสร้างของ JEVisControlCenter กับตัวแปรในไฟล์เทมเพลต",
    "uk": "Посилання на звіт потрібно для заповнення даних. Він пов'язує об'єкт JEVis у дереві JEVisControlCenter зі змінною у файлі шаблону."
  },
  "types": [
    {
      "type": "JEVis ID",
      "descriptions": {
        "de": "JEVis ID des verknüpften Objekts",
        "ru": "JEVis-это идентификатор связанного объекта.",
        "en": "JEVis ID of the linked object",
        "th": "JEVis ID ของวัตถุที่เชื่อมโยง",
        "uk": "JEVis-це ідентифікатор пов'язаного об'єкта"
      },
      "names": {
        "de": "JEVis ID",
        "ru": "JEVis-это",
        "en": "JEVis ID",
        "th": "JEVis ID",
        "uk": "JEVis-це"
      }
    },
    {
      "type": "Optional",
      "descriptions": {
        "de": "Wenn die Variable optional ist, wartet der Bericht nicht auf Daten dieser Datenreihe.",
        "ru": "Если переменная является необязательной, отчет не ожидает данных из этой серии.",
        "en": "If this variable is optional, the report won't wait for data of this data row",
        "th": "หากตัวแปรเป็นทางเลือกรายงานจะไม่รอข้อมูลจากชุดนี้",
        "uk": "Якщо змінна необов’язкова, звіт не чекає даних із цієї серії."
      },
      "names": {
        "de": "Optional",
        "ru": "по желанию",
        "en": "Optional",
        "th": "ไม่จำเป็น",
        "uk": "за бажанням"
      }
    },
    {
      "type": "Calculation",
      "descriptions": {
        "de": "Wenn das verknüpfte Objekt eine Berechnung ist, werden die Werte direkt von der Berechnung bezogen",
        "ru": "Если связанный объект является расчетом, значения берутся непосредственно из расчета.",
        "en": "If the linked object is a calculation, values will be directly calculated",
        "th": "หากออบเจ็กต์ที่เชื่อมโยงเป็นการคำนวณค่าจะถูกนำมาจากการคำนวณโดยตรง",
        "uk": "Якщо пов'язаний об'єкт є обчисленням, значення беруться безпосередньо з розрахунку"
      },
      "names": {
        "de": "Berechnung",
        "ru": "расчет",
        "en": "Calculation",
        "th": "การคำนวณ",
        "uk": "розрахунок"
      }
    },
    {
      "type": "Template Variable Name",
      "descriptions": {
        "de": "Der Name der Variable, mit dem in der Vorlagen-Datei auf die Werte zugegriffen wird.",
        "ru": "Имя переменной, используемой для доступа к значениям в файле шаблона.",
        "en": "Name of the variable, which is used to access the linked values",
        "th": "ชื่อของตัวแปรที่ใช้เพื่อเข้าถึงค่าในไฟล์เทมเพลต",
        "uk": "Ім'я змінної, яка використовується для доступу до значень у файлі шаблону."
      },
      "names": {
        "de": "Vorlagen Variablenname",
        "ru": "Имя переменной шаблона",
        "en": "Template Variable Name",
        "th": "ชื่อตัวแปรเทมเพลต",
        "uk": "Ім'я змінної шаблону"
      }
    }
  ]
}
